<a href="https://colab.research.google.com/github/Rjritik12/COGITATE_TASKS/blob/main/Cogitate2_sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:

UPDATE student_table
SET Name = CASE
    WHEN ID % 2 = 1 THEN Marks
    ELSE Name
    END,
    Marks = CASE
    WHEN ID % 2 = 0 THEN Name
    ELSE Marks
    END;

-- Output:
-- ID  Name  Marks
-- 1   80    John
-- 2   Mary  75
-- 3   90    Peter
-- 4   Alice 85

In [ ]:
CREATE TABLE student_table (
    ID INT,
    Name VARCHAR(50),
    Marks VARCHAR(50)
);

INSERT INTO student_table (ID, Name, Marks)
VALUES
    (1, 'John', '80'),
    (2, '75', 'Mary'),
    (3, 'Peter', '90'),
    (4, '85', 'Alice');

UPDATE student_table
SET Name = CASE
    WHEN ID % 2 = 1 THEN Marks
    ELSE Name
    END,
    Marks = CASE
    WHEN ID % 2 = 0 THEN Name
    ELSE Marks
    END;

SELECT * FROM student_table;

In [9]:
import sqlite3

# Create a connection to the SQLite database
conn = sqlite3.connect('student_database.db')
cursor = conn.cursor()

# Create the student_table
cursor.execute('''
    CREATE TABLE IF NOT EXISTS student_table (
        ID INTEGER,
        Name TEXT,
        Marks TEXT
    )
''')

# Insert sample data into the table
cursor.execute('''
    INSERT INTO student_table (ID, Name, Marks)
    VALUES
        (1, 'John', '80'),
        (2, '75', 'Mary'),
        (3, 'Peter', '90'),
        (4, '85', 'Alice')
''')

# Commit the changes
conn.commit()

# Update the table to swap Name and Marks values based on ID parity
cursor.execute('''
    UPDATE student_table
    SET Name = CASE
        WHEN ID % 2 = 1 THEN Marks
        ELSE Name
    END,
    Marks = CASE
        WHEN ID % 2 = 0 THEN Name
        ELSE Marks
    END
''')

# Commit the changes
conn.commit()

# Fetch and print the updated data
cursor.execute('SELECT * FROM student_table')
rows = cursor.fetchall()
for row in rows:
    print(row)

# Close the connection
conn.close()

(1, '80', '80')
(2, '75', '75')
(3, '90', '90')
(4, '85', '85')